_sdaiWriteRepositoryToFile(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Saves a specified repository to a file.
\param repository [in] A repository instance.
\param fileName   [in] A string that contains the name of the file where the contents of the repository are saved.
\returns sdaiTRUE if the repository was successfully saved into the file; otherwise, the function returns sdaiFALSE.
\remarks
The functions starting from _sdai are ODA extensions over the standard.
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NEXS - Repository does not exist.
* sdaiSY_ERR - Underlying system error.
\code
SdaiRep repo = _sdaiCreateRepository(session, "test_repo");
...
_sdaiWriteRepositoryToFile(repo, "D:\ODA\ExampleFiles\Ifc4\ExportedFile.ifc");